#Использовать ".."
Чтение = Новый ЧтениеJSON;
Чтение.ОткрытьФайл(АргументыКоманднойСтроки[0]);
Запрос = ПрочитатьJSON(Чтение); Чтение.Закрыть();
Профили = ПравилаПакетовХранилища.ПрофилиСозданияОбъектов();
Если Профили.XDTOPackage.files.Package.file <> "Package.bin" Тогда ВызватьИсключение "Не прочитан профиль файла XDTO."; КонецЕсли;
План = СериализаторОбъектаХранилища.ПланПодготовкиИзВыгрузки(Запрос.xml_path, Base64Значение(Запрос.context), Неопределено, Запрос.python);
Если План.kind <> "XDTOPackage" Или План.operation <> "Создание" Тогда ВызватьИсключение "Неверный план XDTO."; КонецЕсли;
Данные = Неопределено;
Если Не План.file_data.Свойство("Package", Данные) Тогда ВызватьИсключение "Потеряны данные XDTO."; КонецЕсли;
Запись = Новый ЗаписьJSON;
Запись.ОткрытьФайл(АргументыКоманднойСтроки[1]);
ЗаписатьJSON(Запись, План); Запись.Закрыть();
